<a href="https://colab.research.google.com/github/Colejoby/DW/blob/master/Norm.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas
##Read Data Frame object

In [32]:
import pandas as pd
df =pd.read_csv ('https://raw.githubusercontent.com/Saranchana/DW/master/titanic_tab.txt', delimiter="\t")
df

     Passenger Class  ... Survived
0              First  ...      Yes
1              First  ...      Yes
2              First  ...       No
3              First  ...       No
4              First  ...       No
...              ...  ...      ...
1304           Third  ...       No
1305           Third  ...       No
1306           Third  ...       No
1307           Third  ...       No
1308           Third  ...       No

[1309 rows x 12 columns]

##Pandas Data Access
###Access header of columm

In [33]:
df.columns

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

###Access data of each column

In [34]:
df['Passenger Class']

0       First
1       First
2       First
3       First
4       First
        ...
1304    Third
1305    Third
1306    Third
1307    Third
1308    Third
Name: Passenger Class, Length: 1309, dtype: object

###Access each elements of data same as numpy

In [35]:
df.iloc[2,0:5]

Passenger Class                                              First
Name                                  Allison, Miss. Helen Loraine
Sex                                                         Female
Age                                                              2
No of Siblings or Spouses on Board                               1
Name: 2, dtype: object

#Pandas Mix Type Dataset

In [38]:
df.dtypes

Passenger Class                        object
Name                                   object
Sex                                    object
Age                                   float64
No of Siblings or Spouses on Board    float64
No of Parents or Children on Board    float64
Ticket Number                          object
Passenger Fare                        float64
Cabin                                  object
Port of Embarkation                    object
Life Boat                              object
Survived                               object
dtype: object

#Find Min & Max

In [42]:
df['Age'].max()

80.0

In [41]:
df['Age'].min()

0.2

#Find specific element in Data Frame
###Use Dataframe to find a specific row or element

In [43]:
df[df['Age']==df['Age'].min()]

    Passenger Class                                     Name  ... Life Boat  Survived
763           Third  Dean, Miss. Elizabeth Gladys "Millvina"  ...        10       Yes

[1 rows x 12 columns]

In [44]:
df['Name'][df['Age']==df['Age'].max()]

14    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

#Missing Valuse
##Find Missing Values

In [45]:
df.isnull()

      Passenger Class   Name    Sex  ...  Port of Embarkation  Life Boat  Survived
0               False  False  False  ...                False      False     False
1               False  False  False  ...                False      False     False
2               False  False  False  ...                False       True     False
3               False  False  False  ...                False       True     False
4               False  False  False  ...                False       True     False
...               ...    ...    ...  ...                  ...        ...       ...
1304            False  False  False  ...                False       True     False
1305            False  False  False  ...                False       True     False
1306            False  False  False  ...                False       True     False
1307            False  False  False  ...                False       True     False
1308            False  False  False  ...                False       True     False

[1309 rows x 12 columns]

##Is there any column with null?

In [46]:
df.isnull().any()

Passenger Class                       False
Name                                  False
Sex                                   False
Age                                    True
No of Siblings or Spouses on Board    False
No of Parents or Children on Board    False
Ticket Number                         False
Passenger Fare                         True
Cabin                                  True
Port of Embarkation                    True
Life Boat                              True
Survived                              False
dtype: bool

#Check any missing data in each column
##AjPle

In [48]:
df.isnull().sum(axis=0)

Passenger Class                          0
Name                                     0
Sex                                      0
Age                                    263
No of Siblings or Spouses on Board       0
No of Parents or Children on Board       0
Ticket Number                            0
Passenger Fare                           1
Cabin                                 1014
Port of Embarkation                      2
Life Boat                              823
Survived                                 0
dtype: int64

In [50]:
df_clean=df.drop(['Age','Cabin','Life Boat'],axis=1)
df_clean.isnull().sum(axis=0)

Passenger Class                       0
Name                                  0
Sex                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Ticket Number                         0
Passenger Fare                        1
Port of Embarkation                   2
Survived                              0
dtype: int64

#Delete Column

In [58]:
df_clean_column = df.drop(['Name','Age','Cabin','Port of Embarkation','Life Boat','Ticket Number'],axis=1)
df_clean_column.isnull().sum(axis=0)

Passenger Class                       0
Sex                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Passenger Fare                        1
Survived                              0
dtype: int64

In [59]:
df_clean_row=df_clean_column.dropna(axis=0)
df_clean_row.isnull().sum(axis=0)

Passenger Class                       0
Sex                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Passenger Fare                        0
Survived                              0
dtype: int64

In [70]:
df_clean_factorize=df_clean_row
data_pass,unused=pd.factorize(df_clean_row['Passenger Class'])
data_sex,unused=pd.factorize(df_clean_row['Sex'])
data_sur,unused=pd.factorize(df_clean_row['Survived'])
df_clean_factorize['Passenger Class']=data_pass
df_clean_factorize['Sex']=data_sex
df_clean_factorize['Survived']=data_sur
df_clean_factorize.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

   Passenger Class  Sex  ...  Passenger Fare  Survived
0                0    0  ...           211.3         0
1                0    1  ...           151.6         0
2                0    0  ...           151.6         1
3                0    1  ...           151.6         1
4                0    0  ...           151.6         1

[5 rows x 6 columns]

#scikit learn

In [96]:
X=df_clean_factorize.drop(['Survived'],axis=1)
y=df_clean_factorize['Survived']
X.head()

   Passenger Class  Sex  ...  No of Parents or Children on Board  Passenger Fare
0                0    0  ...                                 0.0           211.3
1                0    1  ...                                 2.0           151.6
2                0    0  ...                                 2.0           151.6
3                0    1  ...                                 2.0           151.6
4                0    0  ...                                 2.0           151.6

[5 rows x 5 columns]

#Split trian&Test

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y,test_size=0.2 ,random_state=0)

#Normalization

In [105]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler(feature_range=(0,1))
scaler.fit(X_train)

X_train_norm=scaler.transform(X_train)
X_test_norm=scaler.transform(X_test)
X_test_norm

array([[1.        , 0.        , 0.        , 0.        , 0.01542065],
       [0.5       , 1.        , 0.        , 0.        , 0.05075151],
       [0.5       , 1.        , 0.        , 0.        , 0.        ],
       ...,
       [1.        , 1.        , 0.        , 0.        , 0.01522545],
       [0.5       , 0.        , 0.        , 0.        , 0.0204958 ],
       [1.        , 1.        , 0.        , 0.        , 0.01698224]])

#Create Decision Tree Model

In [107]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(random_state=0)
clf.fit(X_train_norm,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=0, splitter='best')

In [111]:
y_predict=clf.predict(X_test_norm)
sum(y_predict==y_test)/len(y_test)

0.8129770992366412